import React from 'react';

const InfoSections: React.FC = () => {
  return (
    <>
      <section className="info-section">
        <h2>التعريف بالموقع</h2>
        <p className="info-section-content">
          المعجم النقدي التفاعلي هو مشروع رقمي يهدف إلى بناء قاعدة معرفية
          شاملة تجمع أبرز المصطلحات والمفاهيم النقدية في مجال الأدب والنقد، وتعرض 
          بطريقة تفاعلية تمكّن المستخدم من البحث والمقارنة والاطلاع على الشروحات المتعددة للمصطلح الواحد.
          كما يقدّم ترجمة دقيقة لهذه المصطلحات باللغتين الفرنسية والإنجليزية،
          لتيسير التواصل المعرفي والانفتاح على الدراسات العالمية.
          يسعى المعجم إلى توضيح الفروق الدلالية بين المصطلحات،
          والحد من فوضى الاصطلاح وتضارب المعاني في البحوث الأكاديمية،
          إضافةً إلى تعزيز الوعي النقدي لدى الباحثين والطلبة، وتوفير
          أداة علمية دقيقة تواكب التحولات المعرفية الحديثة في الخطاب النقدي العربي.
        </p>
      </section>

      <section className="info-section">
        <h2>التعريف بفريق العمل</h2>
        <div className="info-section-content">
          <p>
            <br /><span className="team-name">محمد زبيش</span> متخصص في الدراسات الأدبية والنقدية وأيضاً متخصص في تلقين العلوم الشرعية
          </p>
          <p>
            <br /><span className="team-name">نجوى لبازدة</span> متخصصة في الدراسات الأدبية والنقدية وأيضاً متخصصة في تسيير منشآت التربية والتعليم
          </p>
          <p>
            <br /><span className="team-name">دليلة مختاري</span> متخصصة في الدراسات الأدبية والنقدية وأيضاً متخصصة ايضاً في تربية النشء
          </p>
          <p>
            <br /><span className="team-name">رقية فلاحي</span> متخصصة في الدراسات الأدبية والنقدية
          </p>
          <p>
            <br /><span className="team-name">قيرواني أحمد زين الدين </span>متخصص في الدراسات النقدية والدراسات القانونية والسياسية وتطوير المهارات العملية
          </p>
        </div>
      </section>
    </>
  );
};

export default InfoSections;
